app/views/names/_form.html.erb

        <strong> <%= f_foil_item.label(:make_id,"Foil Type: ") %></strong>
        <%= f_foil_item.collection_select(:make_id,Make.all,:id,:foil_make) %>
        <strong> <%= f_foil_item.label(:length_id,"Starting Foil Length: ")%></strong>
        <%= f_foil_item.collection_select(:length_id,Length.all,:id,:foil_length) %>
---
SELECT "makes".* FROM "makes"
SELECT "lengths".* FROM "lengths"