app/views/names/show.html.erb

SELECT "foil_items".* FROM "foil_items" WHERE "foil_items"."name_id" = ?  [["name_id", 68]]
---
    <th>Last Updated: </th>
    <% @name.foil_items.each do |fi| %>

SELECT  "lengths".* FROM "lengths" WHERE "lengths"."id" = ? LIMIT 1  [["id", 2]]
---
          <td><%=fi.make.foil_make%></td>
          <td><%=fi.length.foil_length%></td>