app/views/foil_items/_form.html.erb

SELECT "names".* FROM "names"
---
    <%= f.label :name_id, "Foil Name:" %><br>
    <%= f.collection_select(:name_id,Name.all,:id,:foil_name) %><br>

SELECT "makes".* FROM "makes"
---
    <%= f.label :make_id, "Foil Type:" %><br>
    <%= f.collection_select(:make_id,Make.all,:id,:foil_make) %><br>

SELECT "lengths".* FROM "lengths"
---
    <%= f.label :length_id, "New Foil Length:" %><br>
    <%= f.collection_select(:length_id,Length.all,:id,:foil_length) %><br>