app/views/foil_items/index.html.erb

        <td><%= foil_item.make.foil_make %></td>
        <td><%= foil_item.length.foil_length %></td>
---
SELECT  "lengths".* FROM "lengths" WHERE "lengths"."id" = ? LIMIT 1  [["id", 5]]