app/views/foil_items/show.html.erb

  <strong>Length:</strong>
  <%= @foil_item.length.foil_length %>
---
SELECT  "lengths".* FROM "lengths" WHERE "lengths"."id" = ? LIMIT 1  [["id", 5]]