app/controllers/foil_calculators_controller.rb

SELECT "foil_calculators".* FROM "foil_calculators"
---
  def index
    @foil_calculators = FoilCalculator.all

INSERT INTO "foil_calculators" ("sheet_quantity", "sheets_per_parent_sheet", "inches_per_parent_sheet", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sheet_quantity", 100.0], ["sheets_per_parent_sheet", 5.0], ["inches_per_parent_sheet", 30.5], ["created_at", "2016-02-26 05:05:20.896063"], ["updated_at", "2016-02-26 05:05:20.896063"]]
---
  def create
    @foil_calculator = FoilCalculator.new(foil_calculator_params)

    respond_to do |format|
      if @foil_calculator.save

SELECT  "foil_calculators".* FROM "foil_calculators" WHERE "foil_calculators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_foil_calculator
      @foil_calculator = FoilCalculator.find(params[:id])