app/controllers/foil_items_controller.rb

  def index
    @foil_items = FoilItem.all
---
SELECT "foil_items".* FROM "foil_items"

  def create
    @foil_item = FoilItem.new(foil_item_params)

    respond_to do |format|
      if @foil_item.save
---
INSERT INTO "foil_items" ("foil_used_length", "name_id", "make_id", "length_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["foil_used_length", 30], ["name_id", 66], ["make_id", 1], ["length_id", 5], ["created_at", "2016-02-20 03:04:01.108975"], ["updated_at", "2016-02-20 03:04:01.108975"]]

    def set_foil_item
      @foil_item = FoilItem.find(params[:id])
---
SELECT  "foil_items".* FROM "foil_items" WHERE "foil_items"."id" = ? LIMIT 1  [["id", 1]]