app/controllers/lengths_controller.rb

  def index
    @lengths = Length.all
---
SELECT "lengths".* FROM "lengths"

    def set_length
      @length = Length.find(params[:id])
---
SELECT  "lengths".* FROM "lengths" WHERE "lengths"."id" = ? LIMIT 1  [["id", 1]]