app/controllers/makes_controller.rb

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def update
    respond_to do |format|
      if @make.update(make_params)
---
UPDATE "makes" SET "foil_make" = ?, "updated_at" = ? WHERE "makes"."id" = ?  [["foil_make", "Zero 9"], ["updated_at", "2016-02-25 18:12:10.257474"], ["id", 3]]

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT 1  [["id", 3]]