app/controllers/names_controller.rb

SELECT "names".* FROM "names"  ORDER BY remaining_foil
---
  def index
    @names = Name.order(sort_column + " " + sort_direction)

INSERT INTO "names" ("foil_name", "pigment_code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["foil_name", "test"], ["pigment_code", "test"], ["created_at", "2016-02-20 06:12:46.461967"], ["updated_at", "2016-02-20 06:12:46.461967"]]
---
  def create
    @name = Name.new(name_params)

    respond_to do |format|
      if @name.save

DELETE FROM "names" WHERE "names"."id" = ?  [["id", 68]]
---
  def destroy
    @name.destroy

SELECT  "names".* FROM "names" WHERE "names"."id" = ? LIMIT 1  [["id", 68]]
---
    def set_name
      @name = Name.find(params[:id])